app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.ratings
      @checks = Movie.checked
      @rel = false
      @tit = false
      if params[:sort_by] == "release_date"
        session[:sort_by] = "release_date"
      elsif params[:sort_by] == "title"
        session[:sort_by] = "title"
      end

      if params.has_key?(:ratings)
        session[:ratings] = params[:ratings]
      else
        flash.keep
        redirect_to movies_path(:ratings => session[:ratings])
      end

      @movies = Movie.order("#{session[:sort_by]}")
---
SELECT "movies".* FROM "movies"  ORDER BY release_date